Revit 2027 API
FamilyTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual FamilyTypeSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As FamilyTypeSetIterator
public:
virtual FamilyTypeSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> FamilyTypeSetIterator
override ForwardIterator : unit -> FamilyTypeSetIterator
Return Value
FamilyTypeSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
FamilyTypeSet Class
Autodesk.Revit.DB Namespace